Sketching of a free form set produces only a single bar.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId SketchFreeFormSet { get; }
  Visual Basic
Public Shared ReadOnly Property SketchFreeFormSet As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SketchFreeFormSet {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace